Repository: zx648383079/ZoDream-Regex
Catalog: UWP-Regex/Strings/*/Resources.resw
Source language: en
Languages: zh_hans

# AboutHeader.Header
source: About
zh_hans: 关于

# AboutTb.Text
source: This program is WPF-Regex UWP version
zh_hans: 本程序为WPF-Regex UWP版

# ContentLabel.Text
source: text:
zh_hans: 正文：

# CopySuccess
source: Copy to the pasteboard!
zh_hans: 已复制到粘贴板！

# DragTip
source: Drag and drop here to add files o(^▽^)o
zh_hans: 拖放此处即可添加文件 o(^▽^)o

# HelpDialog.PrimaryButtonText
source: OK
zh_hans: 确认

# HelpDialog.SecondaryButtonText
source: Cancel
zh_hans: 取消

# HelpDialog.Title
source: Help
zh_hans: 帮助

# HelpLabel.Text
source: 1. {} Direct output defaults to 0, and int can be used. Connect to use the second level content 2. The for statement {for} or {~} start flag For when there is no parameter, it means loop output all for(n) When a parameter is used, it means to output n total from 0 for(m,) When the second parameter defaults, it means to start from m and output all the following For(m,n) with two parameters, it means to start from m and output n total The loop body {} can only be an int or a label, and it no longer supports. Connection. For loops are not currently supported {end} or {!} end flag 3. Integer loop {1 2 ... 7} Start mark {1 ... 7} Circulate from 1 to 7 and output 1 2 3 4 5 6 7 {1,3 ... 7} Circulate from 1 to 7 and each number is separated by 2, which is 1 3 5 7 {16:1 2 ... 15} The hexadecimal number cycled from 1 to 15 is output 1 2 ... F {} Value flag {end} or {!} end tag 4.{m~n} Output random numbers from m to n
zh_hans: 1. {} 直接输出 默认为 0， 可以 int 可以用 . 连接使用第二级的内容 2. for 语句 {for} 或 {~} 开始标志 for 无参数时，表示循环输出全部 for(n) 一个参数时，表示从0 开始 共输出 n 个 for(m,) 第二个参数缺省时，表示从m 开始，输出后面所有的 for(m,n) 两个参数时，表示从 m 开始，共输出 n 个 循环体 {} 只能是 int 或 标签 ，不再支持 . 连接，暂不支持 for 循环 {end} 或 {!} 结束标志 3.整数循环 {1 2 ... 7} 开始标志 {1 ... 7} 从1循环到7 即输出 1 2 3 4 5 6 7 {1,3 ... 7} 从1循环到7 每个数隔2 , 即 1 3 5 7 {16:1 2 ... 15} 从1循环到15的十六进制 即输出 1 2 ... F {} 取值标志 {end} 或者 {!} 结束标志 4.{m~n} 输出 m到n 的随机数

# MatchHeader.Header
source: Match result
zh_hans: 匹配结果

# MatchLabel.Text
source: Extract the list:
zh_hans: 提取列表：

# RegexError
source: There is an error in your regular expression!
zh_hans: 您的正则表达式有错误！

# RegexLabel.Text
source: Regular expression:
zh_hans: 正则表达式：

# ReplaceLabel.Text
source: Output text:
zh_hans: 输出的文字：

# ResultDialog.PrimaryButtonText
source: Copy
zh_hans: 复制

# ResultDialog.SecondaryButtonText
source: Cancel
zh_hans: 取消

# ResultDialog.Title
source: Whether to copy text
zh_hans: 是否复制文字

# StartBtn.Content
source: Start
zh_hans: 开始

# TemplateHeader.Header
source: Output template
zh_hans: 输出模板
